src/InformationRegisters/СоглашенияОЦенообразовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоглашенияОЦенообразовании</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИндивидуальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилоОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Закупки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДопРасходовБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезНДСВВалютеДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезНДСВВалютеВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникГФУНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочиеДоходыРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеРасходовБудущихПериодов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.НачисленияКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураНалоговыйАгент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникГФУРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗапасов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельностиНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельностиКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/КатегорииКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КатегорииКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>VIP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПравилаОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПравилаОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоРубля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>До10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Психологическое99</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ЦенообразованиеРасчет/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция РассчитатьЦену(Товар, Контрагент, Соглашение, ДатаРасчёта, Количество) Экспорт

	Результат = ПодготовитьСтруктуруРезультата();

	ВидЦены = ПолучитьВидЦеныПоСоглашению(Соглашение);
	БазоваяЦена = ПолучитьБазовуюЦену(Товар, ВидЦены, ДатаРасчёта);

	Если БазоваяЦена = 0 Тогда
		Результат.Основание = "Базовая цена не найдена";
		Возврат Результат;
	КонецЕсли;

	Скидки = ПолучитьСкидкиКонтрагента(Контрагент, ДатаРасчёта);

	Цена = ПрименитьПравилаЦенообразования(БазоваяЦена, Скидки, Соглашение);
	Цена = ПроверитьОграничения(Цена, Соглашение.МинимальнаяЦена, 25);
	Цена = ОкруглитьЦену(Цена, Соглашение.ПравилоОкругления);

	Результат.Цена = Цена;
	Результат.ПроцентСкидки = СвернутьПроцентСкидки(Скидки);
	Результат.ПримененныеСкидки = Скидки;
	Результат.Основание = "Расчёт по соглашению " + Соглашение.Наименование;

	ЗаписатьИсториюРасчёта(Новый Структура("Товар, Контрагент, Цена, Скидки",
		Товар, Контрагент, Цена, Скидки));

	Возврат Результат;

КонецФункции

Функция РассчитатьЦеныДокумента(Документ) Экспорт

	Если Документ.Товары.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;

	Результат = Документ.Товары.Выгрузить();
	Результат.Колонки.Добавить("ИтоговаяЦена");
	Результат.Колонки.Добавить("ПроцентСкидки");

	СуммаДокумента = 0;
	Для Каждого Стр Из Результат Цикл
		РасчётСтроки = РассчитатьЦену(
			Стр.Товар, Документ.Контрагент, Документ.Соглашение,
			Документ.Дата, Стр.Количество);
		Стр.ИтоговаяЦена = РасчётСтроки.Цена;
		Стр.ПроцентСкидки = РасчётСтроки.ПроцентСкидки;
		СуммаДокумента = СуммаДокумента + РасчётСтроки.Цена * Стр.Количество;
	КонецЦикла;

	ОптоваяСкидка = ОптоваяСкидкаПоДокументу(Результат);
	Если ОптоваяСкидка > 0 Тогда
		Для Каждого Стр Из Результат Цикл
			Стр.ИтоговаяЦена = Стр.ИтоговаяЦена * (1 - ОптоваяСкидка / 100);
			Стр.ПроцентСкидки = Стр.ПроцентСкидки + ОптоваяСкидка;
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура ОбновитьЦеныПоСоглашению(Контрагент, ДатаНач, ДатаКон) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоглашенияТовары.Номенклатура КАК Товар,
		|	СоглашенияТовары.ВидЦены КАК ВидЦены
		|ИЗ
		|	РегистрСведений.СоглашенияОЦенообразовании.СрезПоследних(&ДатаКон, ) КАК СоглашенияТовары
		|ГДЕ
		|	СоглашенияТовары.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Выборка = Запрос.Выполнить().Выбрать();

	НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл
			НоваяЦена = ПолучитьБазовуюЦену(Выборка.Товар, Выборка.ВидЦены, ДатаКон);
			ЗаписьЦены = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
			ЗаписьЦены.Период = ДатаНач;
			ЗаписьЦены.Номенклатура = Выборка.Товар;
			ЗаписьЦены.ВидЦены = Выборка.ВидЦены;
			ЗаписьЦены.Цена = НоваяЦена;
			ЗаписьЦены.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция РассчитатьСкидку(Клиент, Договор, СуммаЗаказа, ДатаЗаказа) Экспорт

	Скидки = ПолучитьСкидкиКонтрагента(Клиент, ДатаЗаказа);

	ОбщийПроцент = ПолучитьБазовуюСкидку(Договор);
	Для Каждого ЭлементСкидки Из Скидки Цикл
		ОбщийПроцент = ОбщийПроцент + ЭлементСкидки.Процент;
	КонецЦикла;

	Если СуммаЗаказа > 100000 Тогда
		ОбщийПроцент = ОбщийПроцент + 5;
	КонецЕсли;

	Возврат ОграничитьМаксимальнуюСкидку(ОбщийПроцент);

КонецФункции

#КонецОбласти

#Область БазовыеЦены

Функция ПолучитьБазовуюЦену(Товар, ВидЦены, ДатаРасчёта)

	КэшЦен = ПолучитьКэшЦен(Товар, ВидЦены, ДатаРасчёта);
	Если КэшЦен <> Неопределено Тогда
		Возврат КэшЦен;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата,
		|		Номенклатура = &Номенклатура
		|		И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";

	Запрос.УстановитьПараметр("Дата", ДатаРасчёта);
	Запрос.УстановитьПараметр("Номенклатура", Товар);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат 0;
	КонецЕсли;

	Если НЕ ЦенаДействуетНаДату(Выборка, ДатаРасчёта) Тогда
		Возврат 0;
	КонецЕсли;

	ОбновитьКэшЦен(Товар, ВидЦены, ДатаРасчёта, Выборка.Цена);

	Возврат Выборка.Цена;

КонецФункции

Функция ПолучитьВидЦеныПоСоглашению(Соглашение)

	Если НЕ ЗначениеЗаполнено(Соглашение) Тогда
		Возврат Справочники.ВидыЦен.Основная;
	КонецЕсли;

	ВидЦены = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Соглашение, "ВидЦены");
	Если НЕ ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат Справочники.ВидыЦен.Основная;
	КонецЕсли;

	Возврат ВидЦены;

КонецФункции

Функция ЦенаДействуетНаДату(ЗаписьЦены, ДатаПроверки)

	Если ЗаписьЦены.Период > ДатаПроверки Тогда
		Возврат Ложь;
	КонецЕсли;

	РазницаДней = (ДатаПроверки - ЗаписьЦены.Период) / 86400;
	Если РазницаДней > 365 Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

#КонецОбласти

#Область Скидки

Функция ПолучитьСкидкиКонтрагента(Контрагент, ДатаРасчёта)

	Скидки = Новый Массив;

	Категория = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Категория");
	Если Категория = Перечисления.КатегорииКлиентов.VIP Тогда
		ЭлементVIP = Новый Структура("ТипСкидки, Процент, Основание",
			"VIP", 5, "Категория контрагента: VIP");
		Скидки.Добавить(ЭлементVIP);
	КонецЕсли;

	КатегорияПовторно = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Категория");
	Если КатегорияПовторно = Перечисления.КатегорииКлиентов.Новый Тогда
		ЭлементНовый = Новый Структура("ТипСкидки, Процент, Основание",
			"Новый клиент", 2, "Скидка нового клиента");
		Скидки.Добавить(ЭлементНовый);
	КонецЕсли;

	ПериодОбъёма = Новый СтандартныйПериод;
	ПериодОбъёма.ДатаНачала = ДобавитьМесяц(ДатаРасчёта, -3);
	ПериодОбъёма.ДатаОкончания = ДатаРасчёта;
	СкидкаПоОбъёму = РассчитатьСкидкуПоОбъёму(Контрагент, ПериодОбъёма);
	Если СкидкаПоОбъёму > 0 Тогда
		ЭлементОбъём = Новый Структура("ТипСкидки, Процент, Основание",
			"Объём", СкидкаПоОбъёму, "Объём закупок за 3 месяца");
		Скидки.Добавить(ЭлементОбъём);
	КонецЕсли;

	ПроверкаАкции = ПроверитьАкцию(Неопределено, ДатаРасчёта);
	Если ПроверкаАкции > 0 Тогда
		ЭлементАкция = Новый Структура("ТипСкидки, Процент, Основание",
			"Акция", ПроверкаАкции, "Действующая акция на дату расчёта");
		Скидки.Добавить(ЭлементАкция);
	КонецЕсли;

	Возврат Скидки;

КонецФункции

Функция РассчитатьСкидкуПоОбъёму(Контрагент, Период)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЗакупкиОбороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Закупки.Обороты(&ДатаНач, &ДатаКон, ,
		|		Контрагент = &Контрагент) КАК ЗакупкиОбороты";

	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат 0;
	КонецЕсли;

	Сумма = ?(Выборка.Сумма = Null, 0, Выборка.Сумма);

	Если Сумма >= 1000000 Тогда
		Возврат 7;
	ИначеЕсли Сумма >= 500000 Тогда
		Возврат 4;
	ИначеЕсли Сумма >= 100000 Тогда
		Возврат 2;
	КонецЕсли;

	Возврат 0;

КонецФункции

Функция ПроверитьАкцию(Товар, ДатаРасчёта)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Акции.ПроцентСкидки КАК ПроцентСкидки
		|ИЗ
		|	Справочник.Акции КАК Акции
		|ГДЕ
		|	Акции.ДатаНачала <= &Дата
		|	И Акции.ДатаОкончания >= &Дата
		|	И (Акции.Товар = &Товар ИЛИ Акции.Товар = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|УПОРЯДОЧИТЬ ПО
		|	Акции.ПроцентСкидки УБЫВ";

	Запрос.УстановитьПараметр("Дата", ДатаРасчёта);
	Запрос.УстановитьПараметр("Товар", ?(Товар = Неопределено,
		Справочники.Номенклатура.ПустаяСсылка(), Товар));

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентСкидки;
	КонецЕсли;

	Возврат 0;

КонецФункции

Функция ОптоваяСкидкаПоДокументу(ТабличнаяЧасть)

	СуммаИтого = 0;
	Для Каждого Стр Из ТабличнаяЧасть Цикл
		СуммаИтого = СуммаИтого + Стр.ИтоговаяЦена * Стр.Количество;
	КонецЦикла;

	Если СуммаИтого >= 500000 Тогда
		Возврат 5;
	ИначеЕсли СуммаИтого >= 200000 Тогда
		Возврат 3;
	ИначеЕсли СуммаИтого >= 50000 Тогда
		Возврат 1;
	КонецЕсли;

	Возврат 0;

КонецФункции

Функция ПрименитьНакопительнуюСкидку(Контрагент, БазоваяСкидка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЗакупкиОбороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Закупки.Обороты(, , ,
		|		Контрагент = &Контрагент) КАК ЗакупкиОбороты";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат БазоваяСкидка;
	КонецЕсли;

	Сумма = ?(Выборка.Сумма = Null, 0, Выборка.Сумма);
	Если Сумма >= 5000000 Тогда
		Возврат БазоваяСкидка + 3;
	КонецЕсли;

	Возврат БазоваяСкидка;

КонецФункции

#КонецОбласти

#Область ПравилаЦенообразования

Функция ПрименитьПравилаЦенообразования(Цена, Скидки, Соглашение)

	ОбщийПроцент = 0;
	Для Каждого ЭлементСкидки Из Скидки Цикл
		ОбщийПроцент = ОбщийПроцент + ЭлементСкидки.Процент;
	КонецЦикла;

	ИтоговаяЦена = Цена * (1 - ОбщийПроцент / 100);

	МинимальнаяЦена = Соглашение.МинимальнаяЦена;
	Если МинимальнаяЦена > 0 И ИтоговаяЦена < МинимальнаяЦена Тогда
		ИтоговаяЦена = МинимальнаяЦена;
	КонецЕсли;

	Возврат ИтоговаяЦена;

КонецФункции

Функция ПроверитьОграничения(ИтоговаяЦена, МинимальнаяЦена, МаксимальнаяСкидка)

	Если МинимальнаяЦена > 0 И ИтоговаяЦена < МинимальнаяЦена Тогда
		Возврат МинимальнаяЦена;
	КонецЕсли;

	Если МаксимальнаяСкидка > 0 И ИтоговаяЦена < 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат ИтоговаяЦена;

КонецФункции

Функция ОкруглитьЦену(Цена, ПравилоОкругления)

	Если ПравилоОкругления = Перечисления.ПравилаОкругления.ДоРубля Тогда
		Возврат Цел(Цена + 0.5);
	ИначеЕсли ПравилоОкругления = Перечисления.ПравилаОкругления.До10 Тогда
		Возврат Цел((Цена + 5) / 10) * 10;
	ИначеЕсли ПравилоОкругления = Перечисления.ПравилаОкругления.Психологическое99 Тогда
		Возврат Цел(Цена / 100) * 100 + 99;
	КонецЕсли;

	Возврат Цена;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедуры

Функция ПолучитьКэшЦен(Товар, ВидЦены, ДатаРасчёта)

	КэшЦен = ПараметрыСеанса.КэшЦен;
	Если КэшЦен = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ключ = Строка(Товар.УникальныйИдентификатор()) + "|"
		+ Строка(ВидЦены.УникальныйИдентификатор()) + "|"
		+ Формат(ДатаРасчёта, "ДФ=yyyyMMdd");

	Если КэшЦен.Свойство(Ключ) Тогда
		Возврат КэшЦен[Ключ];
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Процедура ОбновитьКэшЦен(Товар, ВидЦены, ДатаРасчёта, Цена)

	КэшЦен = ПараметрыСеанса.КэшЦен;
	Если КэшЦен = Неопределено Тогда
		КэшЦен = Новый Соответствие;
	КонецЕсли;

	Ключ = Строка(Товар.УникальныйИдентификатор()) + "|"
		+ Строка(ВидЦены.УникальныйИдентификатор()) + "|"
		+ Формат(ДатаРасчёта, "ДФ=yyyyMMdd");

	КэшЦен.Вставить(Ключ, Цена);
	ПараметрыСеанса.КэшЦен = КэшЦен;

КонецПроцедуры

Процедура ЗаписатьИсториюРасчёта(ДанныеРасчёта)

	НаборЗаписей = РегистрыСведений.ИсторияРасчётаЦен.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата();
	Запись.Товар = ДанныеРасчёта.Товар;
	Запись.Контрагент = ДанныеРасчёта.Контрагент;
	Запись.ИтоговаяЦена = ДанныеРасчёта.Цена;
	Запись.КоличествоСкидок = ДанныеРасчёта.Скидки.Количество();

	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			"Расчёт цен",
			УровеньЖурналаРегистрации.Предупреждение, ,
			ДанныеРасчёта.Товар,
			ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Функция ПодготовитьСтруктуруРезультата()

	Результат = Новый Структура;
	Результат.Вставить("Цена", 0);
	Результат.Вставить("ПроцентСкидки", 0);
	Результат.Вставить("ПримененныеСкидки", Новый Массив);
	Результат.Вставить("Основание", "");

	Возврат Результат;

КонецФункции

Функция ПолучитьБазовуюСкидку(Договор)

	БазоваяСкидка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "СкидкаПоУмолчанию");
	Если БазоваяСкидка = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Возврат БазоваяСкидка;

КонецФункции

Функция ОграничитьМаксимальнуюСкидку(Скидка)

	МаксимальнаяСкидка = Константы.МаксимальнаяСкидкаПоУмолчанию.Получить();
	Если МаксимальнаяСкидка = 0 Тогда
		МаксимальнаяСкидка = 25;
	КонецЕсли;

	Если Скидка > МаксимальнаяСкидка Тогда
		Возврат МаксимальнаяСкидка;
	КонецЕсли;

	Если Скидка < 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Скидка;

КонецФункции

Функция СвернутьПроцентСкидки(Скидки)

	Сумма = 0;
	Для Каждого ЭлементСкидки Из Скидки Цикл
		Сумма = Сумма + ЭлементСкидки.Процент;
	КонецЦикла;

	Возврат Сумма;

КонецФункции

#КонецОбласти
